src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>ДиректорМагазина</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныЗакупкиТоваров/ЦеныЗакупкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЗакупкиТоваров</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокТоваровТоварПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;
	Строка.Цена = ПолучитьЦену(Строка.Товар);КонецПроцедуры
 
&НаСервере
Функция ПолучитьЦену(ТоварСсылка)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныЗакупкиТоваров.Товар.Ссылка КАК ТоварСсылка,
		|	ЦеныЗакупкиТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныЗакупкиТоваров КАК ЦеныЗакупкиТоваров
		|ГДЕ
		|	ЦеныЗакупкиТоваров.Товар.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТоварСсылка);
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;

	
КонецФункции

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;	
	Строка.Сумма = Строка.Количество * Строка.Цена;                                                
КонецПроцедуры
